eisup_2019_docmng_integration/src/InformationRegisters/КомплектующиеНоменклатуры/КомплектующиеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомплектующиеНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ДоляСтоимости</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комплектующая</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаКомплектующей</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/КомплектующиеНоменклатуры/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл

		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Номенклатура должна быть заполнена обязательно!", Отказ);
		ИначеЕсли ЗаписьРегистра.Номенклатура.Услуга Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Номенклатура не может быть услугой!", Отказ);
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Комплектующая) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Комплектующая должна быть заполнена обязательно!", Отказ);
		ИначеЕсли ЗаписьРегистра.Комплектующая.Услуга Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Комплектующая не может быть услугой!", Отказ);
		ИначеЕсли ЗаписьРегистра.Комплектующая.Набор Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Комплектующая не может быть набором!", Отказ);
		ИначеЕсли ЗаписьРегистра.Комплектующая.Комплект Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Комплектующая не может быть набором-комплектом!", Отказ);
		КонецЕсли;
		
		Если (ЗаписьРегистра.Комплектующая = ЗаписьРегистра.Номенклатура)
		   И ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Номенклатура не может совпадать с комплектующей!", Отказ);
		КонецЕсли;

		Если ЗаписьРегистра.Количество = 0 Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Количество не должно быть нулевым!", Отказ);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
